chanvenjoe/STM32-learning/Projects/N76E003_BSP_Keil_C51_V1.0.6/RF 36V motor controller 25A/Code/Motor_control.c
#include "Motor_control.h"
#include "common.h"
#include "Function_define.h"
#include "N76E003.h"
#include "SFR_Macro.h"
#include "Delay.h"
#include "math.h"

#define Vref  3072;
#define set_IAPEN BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;CHPCON|=SET_BIT0 ;EA=BIT_TMP
#define set_IAPGO BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;IAPTRG|=SET_BIT0 ;EA=BIT_TMP
#define clr_IAPEN BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;CHPCON&=~SET_BIT0;EA=BIT_TMP

uint16_t bgvalue;
static double bgvol;
uint16_t  bgh;
uint8_t  bgl;
static uint16_t ADCValue;
static double ADC_Vol;
UINT8 i;
UINT16 result=0; UINT8  n=0; UINT16 b=1;

void ADC_Init(void)
{
	Enable_ADC_BandGap;													//Find in "Function_define.h" - "ADC INIT"
	set_IAPEN;
	IAPAL = 0x0c; IAPAH = 0x00; IAPCN = 0x04;
	set_IAPGO;
	bgh = IAPFD;
	IAPAL = 0x0d;
	IAPAH = 0x00; IAPCN = 0x04;
	set_IAPGO;
	bgl = IAPFD;
	bgl = bgl&0x0f; // lower four bits 
	clr_IAPEN;		// turn off IAP
	bgvalue=(bgh<<4)+bgl;
	for(i=0;i<12;i++)
	{
		if((bgvalue&b)!=0)
		{
			result=result+pow(2,n); 
			n++; 
			b=b<<1;
			Timer0_Delay1ms(1);
		}
		else
		{ 
			b=b<<1;
			n++;
		}
	}
	bgvalue = result;
		
	bgvol = 3072/4096*bgvalue;
	printf("\nBandgap value:%d\n", bgvalue);
	printf("\nBandgap voltage:%f\n",bgvol);
//	Enable_ADC_AIN4;		//P05 A_Det
//	Enable_ADC_AIN1;		//P30 Speed
}

UINT8 Get_HallValue()
{
	Enable_ADC_AIN0;			//P17 Hall pedal
	clr_ADCF;
	set_ADCS;
	ADCValue = ADCRH<<4|ADCRL;
 	ADC_Vol = 1.2 * ADCValue/bgvalue;
	if(ADC_Vol>1)
	{
		UINT8 i = ADCValue/34;
		return i;
	}
	return 0;
}
